import 'package:school/objects/ColorChoice.dart';
import 'package:school/objects/TodoObject.dart';
import 'package:flutter/material.dart';

List<TodoObject> todos = [
  TodoObject.import("SOME_RANDOM_UUID", "توجيهات قبل الذهاب", 1, ColorChoices.choices[0],  {
    DateTime(2018, 5, 3): [
      TaskObject("تجنب الاقتراض لأداء الحج لأنه خطأ، لأن الحج لا يجب إلا على من استطاع إليه سبيلاً." ),
      TaskObject("حاول جهدك في تعلم المناسك لئلا تعرض نفسك إلى ما يفسد عملك أو ينقص أجرك وأنت لا تدري."),
      TaskObject("اعلم أخي الحاج أن تقليد المذاهب لا بد منه في الحج لذلك لا تحاول أن تحمل نفسك فوق طاقتها (لا يكلف الله نفساً إلا وسعها)."),
      TaskObject("تجنب مزاحمة الناس وإيذاءهم في الطواف والسعي وسائر العبادات."),
      TaskObject("لا تسأل نفسك أو غيرك عن سبب عمل بعض العبادات وحاول أن تسلم نفسك لله تعالى. "),

    ]
  }),
  TodoObject.import("الاحرام", "الاحرام", 2, ColorChoices.choices[1],  {
    DateTime(2018, 5, 3): [
      TaskObject("عند الميقات – أو قبله - تنظف و اغتسل كما تغتسل من الجنابة و تطيب إن تيسر لك ذلك، ثم البس ملابس الإحرام، و هو إزار و رداء."),
      TaskObject("فإن كان وقت فريضة صليت، وإلا فتصلي ركعتين تنوي بهما سنة الوضوء، إلا الحائض والنفساء فلا تصليا."),
      TaskObject("فإذا فرغت من الصلاة فانو الحج بقلبك- عند الميقات- ، وتلفظ بالنسك الذي تريده بقول : لبيك اللهم حجا،فإن كنت خائفاً من عائق يعوقك عن إتمام النسك فينبغي لك أن تشترط عند الإحرام قائلاً: إن حبسني حابس فمحلي حيث حبستني، وإن كنت لا تخاف شيئًا فلا تشترط."),
      TaskObject("بعدها يحرم عليك لبس المخيط و إزالة الشعر ، و تقليم الأظافر ، و تغطية الرأس والوجه بملاصق ؛ كالطاقية والغترة والعمامة أو نحو ذلك ."),
      TaskObject("كما يحرم استعمال الطيب , و الصيد , و عقد النكاح و الجماع"),
      TaskObject("ويحرم على المسلم – محرما كان أم غير محرم ذكرا كان أم أنثى- قتل صيد الحرم والمعاونة في قتله ، ويحرم تنفيره من مكانه ، ويحرم قطع شجر الحرم ونباته الأخضر."),

      TaskObject("ارفع صوتك بالتلبية قائلا<لبيك اللهم لبيك , لبيك لا شريك لك لبيك , إن الحمد و النعمة لك و الملك , لا شريك لك>و المرأة تقول بقدر ما يسمع نفسها ومن بجنبها من النساء أو محارمها."),

    ],


  }),
  TodoObject.import("الطواف", "الطواف", 3, ColorChoices.choices[2],  {
    DateTime(2018, 5, 3): [
      TaskObject("يستحب في بداية الطواف أن يستقبل الكعبة بحيث يكون الحجر الأسود عن يمينه ثم ينتقل ليستقبل الحجر و ينوي الطواف"),
      TaskObject("يستلم الحجر ويقبله إن أمكن ذلك."),
      TaskObject("إذا تعذر تقبيله يلمسه بيده اليمنى (استلام) ويقبل يده."),
      TaskObject("إذا تعذر ذلك يقف بمواجهة الحجر الأسود ويشير إليه بيديه مرة واحدة فقط ويقول بسم الله والله أكبر ثم يبدأ الطواف."),
    ],


  }),

  TodoObject.import("زمزم", "زمزم", 5, ColorChoices.choices[1],  {
    DateTime(2018, 5, 3): [
      TaskObject("ثم بعد ذلك يستحب أن يأتي زمزم فيشرب ويتضلع ويقول عند شربه:اللهم بلغني أن رسول الله قال: (ماء زمزم لما شرب له) وإني أشربه وأدعو: (اللهم إني أسألك علماً نافعاً ورزقاً واسعاً وشفاء من كل داء)."),

    ],


  }),
  TodoObject.import("السعي", "السعي", 5, ColorChoices.choices[2],  {
    DateTime(2018, 5, 3): [
      TaskObject("يصعد إلى الصفا بحيث يرى الكعبة (إذا أمكن) من باب الصفا ويقول حين الصعود:(إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيم)."),
      TaskObject("ثم يصل إلى المروة فهذا شوط واحد فيتم سبعة أشواط يبدأ أولها بالصفا وينتهي آخرها بالمروة."),
      TaskObject("بعد ختام الشوط السابع من السعي يستحب صلاة ركعتين, وفي الحرم أفضل."),
      TaskObject("ويستحب أن يجمع في السعي بين الأذكار والدعوات وما تيسر من القرآن الكريم."),
      TaskObject("لا يشترط الاضطباع في السعي عند الحنفية (أما عند الشافعية فنعم)"),
      TaskObject("لا تشترط الطهارة لصحة السعي ولكن باعتبار أن المسعى أصبح داخل الحرم فيستحب ذلك."),
    ],


  }),



];
